{
  "backend/main.mo": "Main canister actor defining user profiles, suppliers, products, categories, carts, orders, Stripe config, and authorization‑protected query/mutation methods.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the responsibilities of various frontend source files across pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS theme variables and base styles for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Top‑level routing and layout logic handling authentication gates, landing vs authenticated UI, redirects, and global modals.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Unauthenticated‑user screen prompting login via Internet Identity with styled messaging and CTA.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin‑only button that seeds demo products by calling addProduct for predefined entries with loading and toast feedback.",
  "frontend/src/components/Footer.tsx": "App footer showing attribution, dynamic year, and links for privacy, terms, and contact.",
  "frontend/src/components/Header.tsx": "Navigation header handling auth state, cart count syncing, and links for users and suppliers.",
  "frontend/src/components/landing/LandingFooter.tsx": "Landing page footer with navigation links and a dynamic attribution link to caffeine.ai.",
  "frontend/src/components/landing/LandingHeader.tsx": "Landing page header with logo and a button that scrolls to and focuses the email input section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and supplier option, submitting via mutation.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for adding or editing products with form fields, image uploads, and category selection.",
  "frontend/src/components/seller/SellerDashboardNavDrawer.tsx": "Seller dashboard navigation drawer with links, placeholder actions, and a store preview opener.",
  "frontend/src/components/seller/SellerDashboardOnboardingCards.tsx": "Renders onboarding cards for sellers with actions for store setup and adding products using navigation and callbacks.",
  "frontend/src/components/seller/SellerDashboardOverflowMenu.tsx": "Provides an overflow dropdown menu with store settings, view store, and logout actions tied to navigation and identity clearing.",
  "frontend/src/components/seller/SellerDashboardTopBar.tsx": "Displays the seller dashboard top bar including menu toggle, search box, notifications, overflow menu, and user avatar.",
  "frontend/src/components/seller/SellerProductList.tsx": "Shows a product table with editing, deleting, and stock update controls, handling loading, empty state, and mutations.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal prompting initial Stripe configuration with secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useDelayedLoadingFallback.ts": "Provides a delayed fallback flag for loading states, enabling fallback UI only after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for login, identity persistence, and logout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for backend interactions including user profiles, suppliers, products, checkout, and admin checks.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables plus utility classes for shadows and landing-page backgrounds.",
  "frontend/src/main.tsx": "Bootstraps the React app using ReactDOM and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Implements a shopping cart page that loads items from localStorage, allows quantity changes and removal, and displays pricing totals.",
  "frontend/src/pages/CheckoutPage.tsx": "Loads cart items, calculates totals, creates a Stripe checkout session, and redirects the user to Stripe or shows errors.",
  "frontend/src/pages/CreateStorePage.tsx": "Provides a form for creating or editing a supplier store using query hooks and handles submission with success/error feedback.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, email capture for onboarding, Internet Identity login, and marketing sections.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a cancellation message after a failed payment and links back to cart or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a confirmation screen after successful payment with navigation options back home or to products.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search, sorting, supplier/category filters, and add‑to‑cart logic.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard that loads supplier profile and products, handles errors, loading fallback, and product management UI.",
  "frontend/src/pages/StoreViewPage.tsx": "Store detail page showing supplier info, product list, and add‑to‑cart functionality with loading and not‑found states.",
  "frontend/src/pages/SuppliersPage.tsx": "Displays all suppliers with product counts and navigation to their products or store pages.",
  "frontend/src/utils/assets.ts": "Exports paths to static image assets used across the app.",
  "frontend/src/utils/onboardingStorage.ts": "SessionStorage helpers for persisting onboarding email and redirect targets.",
  "frontend/src/utils/productImages.ts": "Utility functions to resolve product and cart item image URLs with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and layout extensions for the frontend. It integrates plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file outlining the platform vision, architectural notes, known issues, and feature definitions for a Shopify-like multi-store system. Used to track versioned requirements and current problems to fix."
}