{
  "backend/main.mo": "Main backend canister implementing user profiles, suppliers, products, carts, orders, Stripe checkout, and access control with storage mixins.",
  "backend/migration.mo": "Placeholder migration module returning old state unchanged for upgrades.",
  "feature_evidence.json": "Feature evidence report mapping features to associated files, components, and tests.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing each frontend file’s purpose.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables defining light/dark UI color tokens.",
  "frontend/index.html": "Root HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with routing, authentication gating, layout, modals, and seller-related routes.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Login-required screen prompting unauthenticated users to authenticate.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin-only button that seeds demo products using backend mutation hooks.",
  "frontend/src/components/Footer.tsx": "Renders a footer showing the current year, a link to caffeine.ai with dynamic hostname tracking, and basic site policy links.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, user auth handling, and dynamic cart count updates.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a required modal for creating a user profile with name, email, and supplier option, submitting via a saveProfile mutation.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for adding or editing a product, handling form state, validation, and submitting to add or update mutations.",
  "frontend/src/components/seller/SellerProductList.tsx": "Displays a seller’s product table with edit and delete actions, including loading skeletons and empty-state messaging.",
  "frontend/src/components/StripeSetupModal.tsx": "Shows an admin-only modal to configure Stripe by submitting a secret key and allowed countries when Stripe is not yet set up.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication state, including loading, login, logout, and identity persistence. Wraps AuthClient creation and exposes status flags and identity data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, including user profiles, suppliers, Stripe configuration, and checkout sessions. Handles fetching, mutations, and cache invalidation for various app features.",
  "frontend/src/index.css": "Sets up Tailwind base, components, and utilities with extensive CSS variables for theming in light and dark modes. Includes global styling and a grid background utility.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider before rendering. Initializes React Query and global styling.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the shopping cart stored in localStorage, offering quantity adjustment, item removal, totals calculation, and navigation to products or checkout. Renders responsive cart UI with product details.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders the checkout screen, loads cart data, computes totals, and creates a Stripe checkout session via backend mutation. Clears the cart and redirects users to Stripe on success.",
  "frontend/src/pages/CreateStorePage.tsx": "Allows suppliers to create or update their store profile with form inputs and backend mutations. Loads existing supplier data when editing and handles form submission with navigation and toast feedback.",
  "frontend/src/pages/HomePage.tsx": "Landing page that shows hero content, feature highlights, and conditional buttons based on authentication and supplier status.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message with options to return to cart or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment confirmation message with buttons to return home or continue shopping.",
  "frontend/src/pages/ProductsPage.tsx": "Product catalog page with search, sorting, supplier filtering, and add‑to‑cart functionality.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard showing store stats, product management, and access to store settings.",
  "frontend/src/pages/SuppliersPage.tsx": "Lists all suppliers with product counts and allows navigating to filtered products.",
  "frontend/src/utils/assets.ts": "Defines static asset paths for images used across the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading and updating supplier and query parameters in the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color tokens, typography, animations, and container settings.",
  "project_state.json": "Project state file describing the platform’s goals, versions, features, required images, and architectural notes for a Shopify-like multi-store system."
}