{
  "backend/main.mo": "Motoko canister managing user profiles, suppliers, products, categories, orders, carts, Stripe config, and authorization via mixins and access control.",
  "feature_evidence.json": "Feature evidence report listing affected files, components, and test IDs for a build/deployment failure investigation task.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose, features, and behavior.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables for light/dark modes and global element styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main routing/layout component handling authentication, onboarding redirects, landing UI, and authenticated app structure.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Unauthenticated access screen prompting the user to log in via Internet Identity.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin-only button that seeds demo products through backend addProduct mutations.",
  "frontend/src/components/Footer.tsx": "Footer showing attribution, dynamic year, and placeholder policy links with caffeine.ai tracking URL.",
  "frontend/src/components/Header.tsx": "Navigation header handling auth, cart count, and links based on user and supplier status.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer with basic navigation links and a dynamic caffeine.ai attribution link.",
  "frontend/src/components/landing/LandingHeader.tsx": "Landing page header with logo and a button that scrolls to the email input section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and supplier option.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for adding or editing products, including images, categories, and pricing.",
  "frontend/src/components/seller/SellerDashboardOnboardingCards.tsx": "Onboarding card set guiding suppliers through initial store setup and product creation.",
  "frontend/src/components/seller/SellerDashboardTopBar.tsx": "Top bar for seller dashboard with search, notifications, and user avatar.",
  "frontend/src/components/seller/SellerProductList.tsx": "Displays a seller’s product table with editing, stock adjustment, and deletion actions using query hooks.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe with secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, suppliers, Stripe, checkout sessions, and product/order operations via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, dark mode themes, and utility classes for layout and styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/CartPage.tsx": "Manages local‑storage backed shopping cart with quantity updates, removal, totals calculation, and empty‑state UI.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that loads cart items, calculates totals, and creates a Stripe checkout session before redirecting.",
  "frontend/src/pages/CreateStorePage.tsx": "Form page for creating or updating a supplier store, prefilled when editing and submitting via API hooks.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page with email capture that triggers Internet Identity login and onboarding flow.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancelled message with links to retry checkout or return to cart.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a successful payment confirmation with options to return home or continue shopping.",
  "frontend/src/pages/ProductsPage.tsx": "Product catalog with searching, filtering, sorting, and add‑to‑cart functionality using supplier and category data.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard showing store info, onboarding actions, and product management with a product creation dialog.",
  "frontend/src/pages/StoreViewPage.tsx": "Renders a supplier store page with hero banner, product listings, and add‑to‑cart logic using supplier/product queries.",
  "frontend/src/pages/SuppliersPage.tsx": "Displays a grid of suppliers with product counts and navigation to product lists or individual store views.",
  "frontend/src/utils/assets.ts": "Exports static asset paths for logos, banners, placeholders, and landing images.",
  "frontend/src/utils/onboardingStorage.ts": "Provides sessionStorage helpers for persisting onboarding email and redirect targets across auth flows.",
  "frontend/src/utils/productImages.ts": "Resolves product and cart image URLs with fallbacks to a placeholder asset.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, animations, and container settings for the UI system.",
  "project_state.json": "Metadata describing the project state, requirements, issues, and architectural notes."
}