{
  "backend/main.mo": "Motoko canister defining user, supplier, product, category, order, cart, and Stripe integration logic with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping redirect logic requirements to affected frontend files and components with high‑confidence traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including routing, pages, components, hooks, utilities, and configuration.",
  "frontend/index.css": "Tailwind base theme definitions using OKLCH variables for light and dark modes plus global background/text styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router layout handling Internet Identity auth, onboarding redirect precedence, and conditional landing vs authenticated UI.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Fullscreen access gate prompting unauthenticated users to log in with Internet Identity.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin‑only button that seeds demo products via addProduct mutations with toast feedback.",
  "frontend/src/components/Footer.tsx": "Footer with dynamic year, caffeine.ai attribution link, and placeholder legal links.",
  "frontend/src/components/Header.tsx": "Navigation header showing links, cart count, and authentication actions based on user and supplier status.",
  "frontend/src/components/landing/LandingFooter.tsx": "Footer with navigation links and a dynamic copyright line linking to caffeine.ai.",
  "frontend/src/components/landing/LandingHeader.tsx": "Landing page header with logo and a button that scrolls to and focuses the email input section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and supplier option, submitting data via mutation.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for adding or editing products, managing form fields, images, and upload progress.",
  "frontend/src/components/seller/SellerProductList.tsx": "Displays seller products with options to edit, update stock, or delete items, plus loading and empty states.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal prompting Stripe secret key and allowed countries to configure payment settings.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to identity, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state and exposing login, logout, and identity info.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods including profiles, suppliers, Stripe config, and checkout sessions.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and utility classes for layout and visual styling.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the shopping cart UI with quantity updates, removal, totals, and persistence in localStorage.",
  "frontend/src/pages/CheckoutPage.tsx": "Loads cart items, calculates totals, and creates Stripe checkout sessions before redirecting the user.",
  "frontend/src/pages/CreateStorePage.tsx": "Form page for creating or editing a supplier store, using queries to load and save supplier profile data.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, email capture, Internet Identity login flow, and marketing sections.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message with options to return to cart or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment confirmation message with links to home or product browsing.",
  "frontend/src/pages/ProductsPage.tsx": "Product catalog with search, sorting, filtering, and add‑to‑cart functionality.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard showing store stats, product list, and management actions with store creation fallback.",
  "frontend/src/pages/StoreViewPage.tsx": "Storefront page displaying supplier details and product list with add‑to‑cart support.",
  "frontend/src/pages/SuppliersPage.tsx": "Lists all suppliers with product counts and navigation to their stores or filtered products.",
  "frontend/src/utils/assets.ts": "Exports static asset paths used throughout the frontend.",
  "frontend/src/utils/onboardingStorage.ts": "Provides helpers to store, fetch, and clear onboarding email and redirect targets in sessionStorage, including an atomic consume method.",
  "frontend/src/utils/productImages.ts": "Returns product or cart item image URLs, falling back to a placeholder when needed.",
  "frontend/src/utils/urlParams.ts": "Utilities to read URL parameters (including from hash), persist them in sessionStorage, and clear them, supporting routing-related state.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme tokens, colors, spacing, animations, plugins, and extended styles for the app.",
  "project_state.json": "Describes the project’s state, goals, issues, and feature list for building a Shopify-like multi-store platform."
}