{
  "backend/main.mo": "Motoko canister defining user profiles, suppliers, products, orders, carts, and Stripe checkout integration with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing UI redesign, dashboard header, onboarding cards, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file summarizing frontend files, routing behavior, major components, hooks, utilities, and styling configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables, light/dark mode tokens, and global element styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app layout and router handling authentication, redirects, landing layout, and global modals.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Unauthenticated access screen with login prompt using Internet Identity.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin-only button that seeds demo products via addProduct mutation.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, dynamic year, and links including a tracked caffeine.ai referral URL.",
  "frontend/src/components/Header.tsx": "Displays the main navigation bar with auth handling, cart count syncing, and conditional links for users and suppliers.",
  "frontend/src/components/landing/LandingFooter.tsx": "Landing page footer with policy links and a caffeine.ai referral section using dynamic year and host identifier.",
  "frontend/src/components/landing/LandingHeader.tsx": "Landing page header showing the logo and a button that scrolls to and focuses the email signup section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a new user’s name, email, and supplier preference with onboarding email prefill.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for creating or editing products, managing form fields, image uploads with previews, and submitting product data.",
  "frontend/src/components/seller/SellerDashboardOnboardingCards.tsx": "Displays onboarding steps for new sellers with cards linking to store setup, product creation, and additional setup actions.",
  "frontend/src/components/seller/SellerDashboardTopBar.tsx": "Top navigation bar for seller dashboard with search, menu, notifications, and avatar initials.",
  "frontend/src/components/seller/SellerProductList.tsx": "Displays a table of seller products with editing, deletion, and stock update actions, including loading and empty states.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin‑only modal prompting initial Stripe configuration, validating input, and saving secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth client, login/logout handling, and context for identity state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, suppliers, products, orders, Stripe setup, and checkout sessions.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, base styles, and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/CartPage.tsx": "Manages and displays shopping cart items with quantity updates, removal, totals, and empty-cart state.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles cart loading, order summary display, and creates a Stripe checkout session before redirecting the user.",
  "frontend/src/pages/CreateStorePage.tsx": "Form page for creating or editing a supplier store, prefilled when editing and submitted via supplier API mutations.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, email capture for onboarding, and Internet Identity login initiation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment-cancelled message with navigation options back to cart or checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success confirmation with links to home or product browsing.",
  "frontend/src/pages/ProductsPage.tsx": "Lists products with search, sorting, filtering, and supports adding items to the cart.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard showing store info, onboarding steps, and product management, prompting store creation if none exists.",
  "frontend/src/pages/StoreViewPage.tsx": "Renders a store view page that loads supplier info and products, displays a hero section, product listings, and supports adding items to the cart.",
  "frontend/src/pages/SuppliersPage.tsx": "Displays a grid of all suppliers with product counts and navigation options to view products or open the store page.",
  "frontend/src/utils/assets.ts": "Exports static asset paths such as logos, banners, and placeholder images.",
  "frontend/src/utils/onboardingStorage.ts": "Provides helpers for storing and retrieving onboarding email and redirect targets in sessionStorage.",
  "frontend/src/utils/productImages.ts": "Utility functions that return product or cart item image URLs with fallbacks to placeholder assets.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugin usage for the project.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architecture notes for the e‑commerce platform."
}