{
  "backend/main.mo": "Main Motoko canister handling user profiles, suppliers, products, categories, orders, carts, access control, Stripe configuration, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report describing a UI update to the seller dashboard overflow menu with linked files, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in routing, UI components, hooks, pages, styling, and utilities.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light/dark modes, colors, and layout base styles.",
  "frontend/index.html": "Base HTML document mounting the root React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root React router layout handling authentication, redirects, route-specific layouts, and global modals/toasters.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen prompting unauthenticated users to log in via Internet Identity.",
  "frontend/src/components/AdminSeedButton.tsx": "Admin-only button that seeds demo products using the addProduct mutation and toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component with dynamic year, caffeine.ai attribution link, and placeholder policy/contact links.",
  "frontend/src/components/Header.tsx": "Header component handling auth, navigation, cart count syncing, and conditional links for users and suppliers.",
  "frontend/src/components/landing/LandingFooter.tsx": "Landing page footer with links and a dynamic attribution link to caffeine.ai.",
  "frontend/src/components/landing/LandingHeader.tsx": "Simple landing header with logo and a button that scrolls to and focuses the email input section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and supplier option, including onboarding email prefill.",
  "frontend/src/components/seller/ProductFormDialog.tsx": "Dialog for adding or editing products, managing form fields, images, and upload progress.",
  "frontend/src/components/seller/SellerDashboardNavDrawer.tsx": "Seller dashboard side drawer providing navigation, placeholders for future features, and product navigation handling.",
  "frontend/src/components/seller/SellerDashboardOnboardingCards.tsx": "Renders onboarding cards for sellers with actions to configure store details and add products. Uses navigation and supplier profile data to guide setup steps.",
  "frontend/src/components/seller/SellerDashboardOverflowMenu.tsx": "Provides a dropdown menu with store settings, view store, and logout actions. Clears identity and cache on logout and redirects accordingly.",
  "frontend/src/components/seller/SellerDashboardTopBar.tsx": "Displays the seller dashboard top bar with a menu button, search input, notifications, overflow menu, and user avatar. Generates initials from the store name.",
  "frontend/src/components/seller/SellerProductList.tsx": "Shows a table of products with editing, stock updates, and delete actions. Handles loading state and empty product lists with UI feedback.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe by submitting a secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor based on Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, managing login, logout, and stored identity restoration. Wraps AuthClient with custom behavior and exposes identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including user profiles, supplier data, Stripe config, checkout sessions, and product actions. Uses the actor for all authenticated calls.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark mode, global styles, and custom utility classes like soft shadows and landing section backgrounds.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CartPage.tsx": "Manages cart state from localStorage, allowing quantity updates and item removal, and renders a detailed cart UI with subtotal and actions.",
  "frontend/src/pages/CheckoutPage.tsx": "Loads cart data, computes totals, and creates a Stripe checkout session via a hook before redirecting the user.",
  "frontend/src/pages/CreateStorePage.tsx": "Displays a form to create or update a supplier store, pre-filling fields if editing and submitting via query hooks.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero content, email signup tied to Internet Identity login, and various marketing sections.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message for canceled payments with navigation buttons back to cart or retry checkout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a successful payment confirmation with options to return home or continue shopping.",
  "frontend/src/pages/ProductsPage.tsx": "Renders a product catalog with search, sorting, supplier/category filters, and add‑to‑cart functionality.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays the seller dashboard with profile loading states, product list, onboarding prompts, and navigation drawer.",
  "frontend/src/pages/StoreViewPage.tsx": "Shows a single store’s profile and products with a hero banner, loading/error states, and add‑to‑cart support.",
  "frontend/src/pages/SuppliersPage.tsx": "Lists all suppliers with product counts and navigation to their store or filtered product listings.",
  "frontend/src/utils/assets.ts": "Defines static asset URLs used across the app such as logos, banners, and placeholders.",
  "frontend/src/utils/onboardingStorage.ts": "Provides sessionStorage helpers for persisting onboarding email and redirect targets.",
  "frontend/src/utils/productImages.ts": "Returns product and cart item image URLs with fallback to a placeholder.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL/query parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, container settings, extended theme values, and animation keyframes.",
  "project_state.json": "Defines project state, goals, architectural notes, known issues, and existing feature requirements for a Shopify-like e‑commerce platform."
}