{
  "kind": "build_request",
  "title": "Fix Seller Dashboard infinite loading and improve load speed",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Investigate and fix the issue where the Seller Dashboard page (/seller-dashboard) stays in a loading state indefinitely and never renders the dashboard for an authenticated seller.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ডাসবোর্ড আসবে কি করে লোডিং এ দিন শেষ লোডিং স্পিড বাড়িয়ে দিন ডাসবোর্ড আসতেছে না একটু চেক করে দেখুন প্লিজ"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated user with an existing supplier profile visits /seller-dashboard, the dashboard UI renders successfully (top bar, onboarding cards, and product section) instead of staying on “Loading dashboard...” indefinitely.",
        "If the supplier profile query cannot complete (e.g., due to authorization/actor issues), the page exits the loading spinner and shows an error state with a working Retry action.",
        "No scenario remains where the page is stuck forever with profileLoading=true or isFetched=false without a user-visible path forward."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Improve Seller Dashboard loading performance by removing or reducing unnecessary query refetch loops triggered during actor initialization/identity changes, and ensure React Query state transitions reliably from loading to success/error for dashboard-critical queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "লোডিং স্পিড বাড়িয়ে দিন"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /seller-dashboard after login completes within a reasonable time and transitions from loading to content without repeated/flickering refetch cycles.",
        "Dashboard-critical queries (caller supplier profile + caller supplier products) do not continuously refetch due solely to actor creation/invalidation side effects.",
        "The dashboard shows a stable loading state only while the actor and required queries are genuinely pending; once they resolve, the UI updates immediately."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Update the Seller Dashboard loading UX so users are not left on an indefinite spinner: add a time-based fallback that offers a clear recovery action (e.g., Retry/Reload) while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "লোডিং এ দিন শেষ"
        ]
      },
      "acceptanceCriteria": [
        "If “Loading dashboard...” persists beyond a short threshold (e.g., ~10–15 seconds), the UI displays a clear message and an action to Retry (refetch) and/or Reload the page.",
        "All new/updated user-facing text on the loading fallback is English and consistent with the rest of the app’s tone.",
        "The fallback does not break normal fast loads (i.e., it should not appear when the dashboard loads quickly)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (immutable paths). If changes are needed, implement them via composition/wrappers or changes in non-immutable files such as frontend/src/hooks/useQueries.ts and page components.",
    "Do not add new backend canisters or external services; keep the existing single-actor Motoko backend architecture."
  ],
  "nonGoals": [
    "No new product features or dashboard redesign beyond what is necessary to resolve the loading issue and improve load speed/UX.",
    "No changes to authentication provider (must remain Internet Identity)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}