{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Authenticated home-route redirect to seller dashboard with onboarding precedence",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Redirect authenticated users away from / to /seller-dashboard so the public landing page never renders for authenticated users.",
      "acceptanceCriteria": [
        "Given an authenticated user, when they navigate to /, they are redirected to /seller-dashboard without seeing the landing page UI.",
        "Given an unauthenticated user, when they navigate to /, they still see the public landing page as before.",
        "Navigating directly to non-home routes (e.g., /products, /suppliers, /seller-dashboard) continues to behave as it does today (protected by auth gating where applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update RootLayout redirect logic so that when Internet Identity is present (authenticated state from the authorization component via useInternetIdentity—verify the component's usage instructions before implementing) and the current route is '/', the app navigates to '/seller-dashboard' unless an onboarding redirect target is present. Add a render guard for the '/' route while redirecting to prevent the landing page UI from flashing for authenticated users; keep all other route gating unchanged."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Preserve onboarding redirect behavior and ensure it takes precedence over the new authenticated / -> /seller-dashboard redirect.",
      "acceptanceCriteria": [
        "If onboardingStorage has a redirect target set (e.g., /seller-dashboard) and the user completes login, the app navigates to that target and clears the stored redirect target.",
        "If onboardingStorage has a redirect target set to a non-home route, that target is used after login even if the user lands on /.",
        "After redirect, refreshing the app while still authenticated does not show the landing page at /; it redirects to /seller-dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/onboardingStorage.ts",
          "operation": "modify",
          "description": "Add a small helper (e.g., a 'consume' method) to atomically read and clear the stored onboarding redirect target to avoid conflicts/double-navigation when multiple redirect conditions are evaluated."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the post-login/on-auth redirect effect to use the onboardingStorage consume helper and enforce precedence: if a redirect target exists, navigate to it and clear it; otherwise, if authenticated and on '/', navigate to '/seller-dashboard'. Ensure this logic cooperates with Internet Identity auth state from the authorization component (verify the component's usage instructions before implementing) and does not alter authentication gating for any non-home routes."
        }
      ]
    }
  ]
}